# Creating Pandas DataFrames

## Create an Empty Pandas Dataframe and Append Data

In [1]:
import pandas as pd

df = pd.DataFrame()
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [2]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
print(df.empty)

True

In [4]:
print(df.empty)

True

We can use the `columns=` parameter when creating the dataframe object to pass in a list of columns.

In [5]:
df = pd.DataFrame(columns=
                  ['Name', 'Age', 'Gender'])

print(df)

Empty DataFrame
Columns: [Name, Age, Gender]
Index: []

In [6]:
df

Empty DataFrame
Columns: [Name, Age, Gender]
Index: []

In [7]:
print(df.empty)

True

###### Add Data to an Empty Dataframe

You can use the `df.loc()` function to add a row to the end of a pandas DataFrame:

In [8]:
idx = len(df.index)
print(idx)

0

In [9]:
df.loc[idx,'Name'] = 'Eva'
df.loc[idx,'Age'] = 21
df.loc[idx,'Gender'] = 'F'

df

  Name Age Gender
0  Eva  21      F

In [10]:
idx = len(df.index)
print(idx)

1

In [11]:
df.loc[idx,'Name'] = 'Jerry'
df.loc[idx,'Age'] = 25
df.loc[idx,'Gender'] = 'M'

df

    Name Age Gender
0    Eva  21      F
1  Jerry  25      M

In [12]:
print(df)

    Name Age Gender
0    Eva  21      F
1  Jerry  25      M

###### Append Data to an Empty Pandas Dataframe use Concatenation

We can use the `pd.concat()` function to append several rows of an existing DataFrame to the end of another DataFrame:

In [13]:
tt = pd.DataFrame(
    [['Jane', 23, 'London', 'F']], 
    columns=['Name', 'Age', 'Birth City', 'Gender']
    )

df = pd.concat([df, tt], ignore_index = True)

df

    Name Age Gender Birth City
0    Eva  21      F        NaN
1  Jerry  25      M        NaN
2   Jane  23      F     London

## Creating dataframe from series

To create a dataframe from series, we must pass series as argument to DataFrame() function.

In [14]:
import pandas as pd

fruits_series = pd.Series(['apple', 'banana', 'cherry'])

df = pd.DataFrame(fruits_series, columns=['Fruit'])

In [15]:
df

    Fruit
0   apple
1  banana
2  cherry

In [16]:
import pandas as pd

fruits_series = pd.Series(['apple', 'banana', 'cherry'], 
                          index=['A', 'B', 'C'])

df = pd.DataFrame(fruits_series, columns=['Fruit'])
df

    Fruit
A   apple
B  banana
C  cherry

## Creating a dataframe using List
DataFrame can be created using a single list or a list of lists.

In [17]:
data = ['Apple', 'Banana', 'Orange', 'Grape', 'Lemon']

df = pd.DataFrame(data, columns=['Fruits'])
df

   Fruits
0   Apple
1  Banana
2  Orange
3   Grape
4   Lemon

## Creating DataFrame from dict of lists

In [18]:
import pandas as pd
 
data = {'Name':['Ashok', 'Wendy', 'Tina', 'Justin'],
        'Age':[23, 21, 39, 38]}
 
df = pd.DataFrame(data)
df

     Name  Age
0   Ashok   23
1   Wendy   21
2    Tina   39
3  Justin   38

## Creating Dataframe from list of dicts

Pandas DataFrame can be created by passing lists of dictionaries as a input data. By default dictionary keys will be taken as columns.

In [19]:
# Python code demonstrate how to create
# Pandas DataFrame by lists of dicts.
import pandas as pd
  
list_of_dicts = [{'Name': 'Nik', 'Age': 33, 'Location': 'Toronto'},
                 {'Name': 'Kate', 'Age': 32, 'Location': 'London'},
                 {'Name': 'Evan', 'Age': 36}]

df = pd.DataFrame.from_dict(list_of_dicts)
df

   Name  Age Location
0   Nik   33  Toronto
1  Kate   32   London
2  Evan   36      NaN

In [20]:
data = [{'Name': 'John', 'Age': 20, 'Occupation': 'Student'},
        {'Name': 'Mary', 'Age': 19, 'Occupation': 'Teacher'},
        {'Name': 'Tom', 'Age': 32, 'Occupation': 'Doctor'}]

df = pd.DataFrame(data)
df

   Name  Age Occupation
0  John   20    Student
1  Mary   19    Teacher
2   Tom   32     Doctor

In [21]:
data = [{'Name': 'John', 'Age': 20, 'Occupation': 'Student'},
        {'Name': 'Mary', 'Age': 19, 'Occupation': 'Teacher'},
        {'Name': 'Tom', 'Age': 32, 'Occupation': 'Doctor'}]

df = pd.DataFrame(data,columns=['Name', 'Age'])
df

   Name  Age
0  John   20
1  Mary   19
2   Tom   32

In [22]:
data = {
  "name": ["John", "Jane"],
  "age": [30, 27],
  "height": [174, 168]
}
df = pd.DataFrame(data)
df

   name  age  height
0  John   30     174
1  Jane   27     168

## Creating DataFrame using a List of Tuples

In [23]:
data = [("Apple", 10, 2), 
        ("Orange", 5, 3), 
        ("Banana", 3, 1)]

df = pd.DataFrame(data)
df

        0   1  2
0   Apple  10  2
1  Orange   5  3
2  Banana   3  1

In [24]:
data = [("Apple", 10, 2), 
        ("Orange", 5, 3), 
        ("Banana", 3, 1)]

df = pd.DataFrame(data, columns=["Fruit", "Count", "Price"])
df

    Fruit  Count  Price
0   Apple     10      2
1  Orange      5      3
2  Banana      3      1

## List-Dict-DataFrame

In [25]:
import pandas as pd

# Define the lists
names = ['tom', 'krish', 'nick', 'juli']
ages = [25, 30, 26, 22]

# Create a dictionary using list items as keys and their corresponding values
data = {
    'Name': names,
    'Age': ages
}

# Convert the dictionary into a pandas DataFrame
df = pd.DataFrame(data)

# Print the resulting DataFrame
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [26]:
import pandas as pd

names = ['tom', 'krish', 'nick', 'juli']
ages = [25, 30, 26, 22]

data = {
    'Name': names,
    'Age': ages
}

df = pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])
df

    Name  Age
a    tom   25
b  krish   30
c   nick   26
d   juli   22

## Creating DataFrame from Dictionary of series

In [27]:
import pandas as pd

names = pd.Series(['tom', 'krish', 'nick', 'juli'],
                  index=['a', 'b', 'c', 'd'])

ages = pd.Series([25, 30, 26, 22],
                 index=['a', 'b', 'c', 'd'])

data = {'Name': names,
        'Age': ages}

df = pd.DataFrame(data)
df

    Name  Age
a    tom   25
b  krish   30
c   nick   26
d   juli   22

In [28]:
import pandas as pd

data = {'Name': pd.Series(['tom', 'krish', 'nick', 'juli'],
                  index=['a', 'b', 'c', 'd']),
        'Age': pd.Series([25, 30, 26, 22],
                 index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(data)
df

    Name  Age
a    tom   25
b  krish   30
c   nick   26
d   juli   22

## Creating DataFrame using zip() function

In [29]:
# Python program to demonstrate creating
# pandas Dataframe from lists using zip.
  
import pandas as pd
  
# List1
Name = ['tom', 'krish', 'nick', 'juli']
  
# List2
Age = [25, 30, 26, 22]
  
# get the list of tuples from two lists.
# and merge them by using zip().
list_of_tuples = list(zip(Name, Age))
  
# Assign data to tuples.
print(list_of_tuples)

[('tom', 25), ('krish', 30), ('nick', 26), ('juli', 22)]

In [30]:
# Converting lists of tuples into
# pandas Dataframe.
df = pd.DataFrame(list_of_tuples,
                  columns=['Name', 'Age'])
  
# Print data.
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22